In [1]:
import pandas as pd

In [4]:
d = {"roll":[1,2,3,4,5],"name":["a","b","c","d","e"],"marks":[12,34,50,67,45]}

In [5]:
df = pd.DataFrame(d)

In [6]:
print(df)

   roll name  marks
0     1    a     12
1     2    b     34
2     3    c     50
3     4    d     67
4     5    e     45

In [7]:
df.info

<bound method DataFrame.info of    roll name  marks
0     1    a     12
1     2    b     34
2     3    c     50
3     4    d     67
4     5    e     45>

In [8]:
df.head()

   roll name  marks
0     1    a     12
1     2    b     34
2     3    c     50
3     4    d     67
4     5    e     45

In [9]:
df.tail()

   roll name  marks
0     1    a     12
1     2    b     34
2     3    c     50
3     4    d     67
4     5    e     45

In [10]:
df.mean()

roll      3.0
marks    41.6
dtype: float64

In [11]:
df.sum()

roll        15
name     abcde
marks      208
dtype: object

In [12]:
df.min()

roll      1
name      a
marks    12
dtype: object

In [13]:
df.max()

roll      5
name      e
marks    67
dtype: object

In [14]:
df.count()

roll     5
name     5
marks    5
dtype: int64

In [15]:
df.describe()

           roll      marks
count  5.000000   5.000000
mean   3.000000  41.600000
std    1.581139  20.378911
min    1.000000  12.000000
25%    2.000000  34.000000
50%    3.000000  45.000000
75%    4.000000  50.000000
max    5.000000  67.000000

### Acessing the values in the dataframe

### iloc
#### dataframe.iloc[row,col]

In [16]:
df.iloc[1,1]

'b'

In [20]:
df.iloc[[1,3],[0,1,2]]

   roll name  marks
1     2    b     34
3     4    d     67

#### slicing

In [19]:
df.iloc[[1,3],:]

   roll name  marks
1     2    b     34
3     4    d     67

In [21]:
df.iloc[1::2,:]

   roll name  marks
1     2    b     34
3     4    d     67

### loc

#### dataframe.loc[row,col]

##### to acess the row you'll need an index, but in order to acess the column we need to write the column name

In [22]:
df.loc[1,"name"]

'b'

In [24]:
df.loc[[1,3]]

   roll name  marks
1     2    b     34
3     4    d     67

In [25]:
df.loc[[1,2,3],["marks"]]

   marks
1     34
2     50
3     67

##### slicing can only be applied to the rows in loc[]

In [26]:
df.loc[[1,2,3],["name","marks"]]

  name  marks
1    b     34
2    c     50
3    d     67

### Coverting dataframe to csv

In [27]:
df.to_csv("lec8.csv")

In [28]:
df.to_csv("lec8withoutindexcol.csv",index = False)